app/controllers/course_controller.rb

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 932408349038)

  def create
    @course = Course.new(params[:course])
    @event = Events.new(:data => {
      "course_name" => @course.courseName,
      "course_city" => @course.courseCity,
      "course_state" => @course.courseState,
      "course_id" => @course.courseID,
      "created_by" => current_user.name
    }, :user_id => current_user.id, :event_type => "course_add")
    if @course.save
      @event.save
---
INSERT INTO "courses" ("created_at", "courseID", "updated_at", "courseState", "courseName", "courseCity", "courseCountry", "ownerID") VALUES('2009-11-06 20:34:13', '191018', '2009-11-06 20:34:13', 'PA', 'Brian''s Run', 'Horsham', 'United States', 1)
INSERT INTO "events" ("data", "created_at", "updated_at", "user_id", "type") VALUES(NULL, '2009-11-27 20:31:28', '2009-11-27 20:31:28', NULL, 'newcourse')

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 2)

  def update
    @course = Course.find(params[:id])
    if @course.update_attributes(params[:course])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 40)
UPDATE "courses" SET "courseCountry" = 'United States', "updated_at" = '2009-11-06 17:43:42' WHERE "id" = 40

  def delete
    Course.find(params[:id]).destroy
---
DELETE FROM "courses" WHERE "id" = 1
SELECT * FROM "courses" WHERE ("courses"."id" = 1)