app/controllers/friendships_controller.rb

  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    @event = Events.new(:data => {
      "friend_name" => User.find(:first, :conditions => {:id => @friendship.friend_id}).name,
      "created_by" => current_user.name
    }, :user_id => current_user.id, :event_type => "friend_add")
    if @friendship.save
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
INSERT INTO "friendships" ("created_at", "updated_at", "user_id", "friend_id") VALUES('2009-11-20 16:03:48', '2009-11-20 16:03:48', 1, '2')

  def delete
    @friendship = current_user.friendships.find(params[:id])
    @friendship.destroy
---
SELECT * FROM "friendships" WHERE ("friendships"."id" = 15 AND ("friendships".user_id = 1))
DELETE FROM "friendships" WHERE "id" = 15