app/controllers/run_controller.rb

  def create
    @run = Run.new(params[:run])
    @run.save
---
INSERT INTO "runs" ("created_at", "runTime", "updated_at", "user_id", "course_id") VALUES('2009-11-13 20:03:15', NULL, '2009-11-13 20:03:15', '2', '9999481710')