app/controllers/user_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def list
    @user = User.find(:all)

INSERT INTO "users" ("name", "created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('Brian Michel', '2009-11-09 21:51:10', 'eb62e8976b40451b550a8111123014560e79ca9a393424cf224d38664d82181a0bd4056096e9485f4df1a9bd26c4538316fba0c584ce24513aa6fd02c1fbbdab', '2009-11-09 21:51:10', 'bmichel', 'P0Vnghb_BBSU_bZ1uekz', '123dd32af2b2ac2678ed99cc522b0ceb1f0564c61a8d1bebc9321aa22296220269ac43b23646c836ffca2928af07a2ce01f47644be8f57e75a2cf594d5e3a25a', 'brian.michel@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2009-11-06 00:42:24', "active" = 'f' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE "id" = 3
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def delete
    @user = User.find(params[:id]).destroy